COMMANDS_help = {
    "/start": "Отображает приветствие бота.",
    "\n/SFU": "Показывается информацию о университете..",
    "\n/ekursi": "Показывается информация о этом платформе университета.",
    "\n/moi_sfu": "Показывается информация о этом платформе университета.",
    "\n/schedules": "Показывается ссылка на расписание занятий в зависимости от вашей группы",
    "\n/teachers": "Показываются имена преподавателей в зависимости от кафедры.",
    "\n/payments": "Показывается меню, где можно выбрать в зависимости от вашей потребности оплаты.",
    "\n/info_bot": "Показывается информация о боте.",
    "\n/help": "Показываются все доступные команды."
}


texto_SFU = {
    "I": '<a href="https://www.sfu-kras.ru/">Сибирский федеральный университет </a>' + "(ссылка) был основан в 2006 году путем объединения нескольких учебных заведений в Красноярске, став одним из крупнейших университетов России,",
    "N": "\nЕго цель – развитие науки и технологий в Сибири с акцентом на инженерное дело, химию, информационные технологии и прикладные исследования.",
    "F": "\nВ настоящее время он является важным центром инноваций и образования в регионе.",
}


COMMANDS_main = {
    "/start": "Отображает приветствие бота.",
    "\n/menu_SFU": "Показывается меню с информацией для получения дополнительной информации",
    "\n/info_bot": "Показывается информация о боте.",
    "\n/help": "Показывается все доступные команды."
}


COMMANDS_menu_SFU = {
    "/SFU": "Показывается краткий обзор университета.",
    "\n/ekursi": "Показывается информация о этом платформе университета.",
    "\n/moi_sfu": "Показывается информация о этом платформе университета.",
    "\n/teachers": "Показываются имена преподавателей в зависимости от кафедры.",
    "\n/payments": "Показывается меню, где можно выбрать в зависимости от вашей потребности оплаты.",
    "\n/schedules": "Показывается ссылка на расписание занятий в зависимости от вашей группы"
}


COMMANDS_inst = {
    "/Bii": "Военно-инженерный институт",
    "\n/GI": "Гуманитарный институт",
    "\n/ICI": "Инженерно-строительный институт",
    "\n/IAID": "Институт архитектуры и дизайна",
    "\n/IIFIRE": "Институт инженерной физики и радиоэлектроники",
    "\n/IKIT": "Институт космических и информационных технологий",
    "\n/IMIFI": "Институт математики и фундаментальной информатики",
    "\n/INIG": "Институт нефти и газа",
    "\n/IPPS": "Институт педагогики, психологии и социологии",
    "\n/ISIA": "Институт Севера и Арктики",
    "\n/IFKSIT": "Институт физической культуры, спорта и туризма",
    "\n/IFIAK": "Институт филологии и языковой коммуникации",
    "\n/IFBIB": "Институт фундаментальной биологии и биотехнологии",
    "\n/ITSM": "Институт цветных металлов",
    "\n/IZIG": "Институт экологии и географии",
    "\n/DSP": "Департамент стратегического развития",
    "\n/IG": "Институт гастрономии",
    "\n/INISY": "Институт торговли и сферы услуг",
    "\n/IUBP": "Институт управления бизнес-процессами",
    "\n/IEGUIF": "Институт экономики, государственного управления и финансов",
    "\n/PI": "Политехнический институт",
    "\n/YUI": "Юридический институт",
}


Bii = {
    "-Гарин Евгений Николаевич": 'директор',
    "\n-Мамаева Елена Александровна": "заместителя директора по воспитательной работе",
    "\n-Михов Евгений Дмитриевич": "доцент",
    "\n-Копылов Владимир Алексеевич": "заместитель начальника",
    "\n-Лой Виталий Викторович": "начальник учебной части – заместитель начальника ВУЦ",
    "\n-Гладышев Андрей Борисович": "Кафедра № 6, начальник",
    "\n-Гончарик Сергей Владимирович": "Кафедра № 7, начальник",
    "\n-Иванов Максим Александрович": "Цикл, начальник",
    "\n-Колупаев Алексей Юрьевич": "Кафедра № 2, начальник",
    "\n-Лыхо Андрей Вячеславович": "Кафедра № 3, начальник",
    "\n-Михайлов Олег Борисович": "Михайлов Олег Борисович",
    "\n-Сибиряков Иван Николаевич": "Кафедра № 8, начальник",
    "\n-Чаринцев Дмитрий Алексеевич": "Кафедра № 1, начальник",
    "\n-Янович Валерий Станиславович": "Кафедра № 5, начальник"
}


Gi = {
    "/gi_1": "Кафедра информационных технологий в креативных и культурных индустриях",
    "\n/gi_2": "Кафедра истории России, мировых и региональных цивилизаций",
    "\n/gi_3": "Кафедра культурологии и искусствоведения",
    "\n/gi_4": "Кафедра рекламы и социально-культурной деятельности",
    "\n/gi_5": "Кафедра философии",
    "\n/gi_6": "Лаборатория археологии Енисейской Сибири",
    "\n/gi_7": "Лаборатория естественнонаучных методов в археологии и истории",
    "\n/gi_8": "Лаборатория компьютерной графики",
    "\n/gi_9": "Музей археологии и этнографии Енисейской Сибири",
    "\n/gi_10": "Учебно-организационный отдел"
}


gi_1 = {
    "Лаптева Марина Анатольевна": "и. о. заведующего",
    "\nАнтамошкин Олеслав Александрович": "профессор",
    "\nБарышев Руслан Александрович": "доцент",
    "\nБрюханова Евгения Романовна": "старший преподаватель",
    "\nГорячева Ольга Евгеньевна": "доцент",
    "\nГурьянов Илья Сергеевич": "старший преподаватель",
    "\nКижнер Инна Александровна": "доцент",
    "\nМусат Раиса Павловна": "профессор",
    "\nНигматуллин Илья Рафаильевич": "ассистент",
    "\nПиков Никита Олегович": "старший преподаватель",
    "\nРумянцев Максим Валерьевич": "доцент",
    "\nСенотрусова Полина Олеговна": "доцент",
}

gi_2 = {
    "Гергилёв Денис Николаевич": "Аксенова Марина Николаевна",
    "Андюсев Борис Ермолаевич": "доцент",
    "Аксенова Марина Николаевна": "доцент",
    "Ахтамов Евгений Александрович": "доцент",
    "Барабанова Диана Дмитриевна": "доцент",
    "Барсукова Наталья Владимировна": "доцент",
    "Гергилёва Алла Ивановна": "доцент",
    "Голубева Елена Владимировна": "доцент",
    "Григорьева Екатерина Александровна": "доцент",
    "Грязнухин Александр Григорьевич": "доцент",
    "Губкин Василий Федорович": "доцент",
    "Дворецкая Анна Павловна": "доцент",
    "Долидович Олеся Михайловна": "доцент",
    "Жулаева Анна Сергеевна": "доцент",
    "Карчаева Татьяна Геннадьевна": "доцент",
    "Кручко Галина Викторовна": "доцент",
    "Кузьменко Александра Сергеевна": "доцент",
    "Кутилова Лариса Александровна": "доцент",
    "Кушнаренко Елена Евгеньевна": "доцент",
    "Леопа Владимир Павлович": "доцент",
    "Лущаева Галина Михайловна": "доцент",
    "Малютина Лариса Федоровна": "доцент",
    "Мариненко Людмила Евгеньевна": "доцент",
    "Никуленков Василий Валентинович": "доцент",
    "Нихочина Анна Анатольевна": "доцент",
    "Новосельцев Николай Рзавич": "доцент",
    "Пахомова Наталья Вениаминовна": "доцент",
    "Савин Олег Игоревич": "доцент",
    "Сафронов Сергей Алексеевич": "доцент",
    "Сенотрусова Полина Олеговна": "доцент",
    "Тарасов Михаил Георгиевич": "доцент",
    "Уметбаев Тимур Шамильевич": "доцент",
    "Хаит Надежда Леонидовна": "доцент"
}

ikit= {
    "1": '<a href="https://ikit.sfu-kras.ru/kafi">Программной Инженерии</a>',
    "2": '<a href="https://ikit.sfu-kras.ru/kafi">ajsdasjds'
}