#Todos los comandos incluidos en help
COMMANDS_help = {
    "/start": "Отображает приветствие бота.",
    "\n/SFU": "Показывается информацию о университете..",
    "\n/ekursi": "Показывается информация о этом платформе университета.",
    "\n/moi_sfu": "Показывается информация о этом платформе университета.",
    "\n/schedules": "Показывается ссылка на расписание занятий в зависимости от вашей группы",
    "\n/teachers": "Показываются имена преподавателей в зависимости от кафедры.",
    "\n/payments": "Показывается меню, где можно выбрать в зависимости от вашей потребности оплаты.",
    "\n/info_bot": "Показывается информация о боте.",
    "\n/help": "Показываются все доступные команды."
}

#texto que se usa para la informacion sobre la U
texto_SFU = {
    "I": '<a href="https://www.sfu-kras.ru/">Сибирский федеральный университет </a>' + "(ссылка) был основан в 2006 году путем объединения нескольких учебных заведений в Красноярске, став одним из крупнейших университетов России,",
    "N": "\nЕго цель – развитие науки и технологий в Сибири с акцентом на инженерное дело, химию, информационные технологии и прикладные исследования.",
    "F": "\nВ настоящее время он является важным центром инноваций и образования в регионе.",
}

#Comandos principales
COMMANDS_main = {
    "/start": "Отображает приветствие бота.",
    "\n/menu_SFU": "Показывается меню с информацией для получения дополнительной информации",
    "\n/info_bot": "Показывается информация о боте.",
    "\n/help": "Показывается все доступные команды."
}

#menu de la universidad
COMMANDS_menu_SFU = {
    "/SFU": "Показывается краткий обзор университета.",
    "\n/ekursi": "Показывается информация о этом платформе университета.",
    "\n/moi_sfu": "Показывается информация о этом платформе университета.",
    "\n/teachers": "Показываются имена преподавателей в зависимости от кафедры.",
    "\n/payments": "Показывается меню, где можно выбрать в зависимости от вашей потребности оплаты.",
    "\n/schedules": "Показывается ссылка на расписание занятий в зависимости от вашей группы"
}

#Comandos de todos los institutos
COMMANDS_inst = {
    "/Bii": "Военно-инженерный институт",
    "\n/GI": "Гуманитарный институт",
    "\n/ICI": "Инженерно-строительный институт",
    "\n/IAID": "Институт архитектуры и дизайна",
    "\n/IIFIRE": "Институт инженерной физики и радиоэлектроники",
    "\n/IKIT": "Институт космических и информационных технологий",
    "\n/IMIFI": "Институт математики и фундаментальной информатики",
    "\n/INIG": "Институт нефти и газа",
    "\n/IPPS": "Институт педагогики, психологии и социологии",
    "\n/ISIA": "Институт Севера и Арктики",
    "\n/IFKSIT": "Институт физической культуры, спорта и туризма",
    "\n/IFIAK": "Институт филологии и языковой коммуникации",
    "\n/IFBIB": "Институт фундаментальной биологии и биотехнологии",
    "\n/ITSM": "Институт цветных металлов",
    "\n/IZIG": "Институт экологии и географии",
    "\n/DSP": "Департамент стратегического развития",
    "\n/IG": "Институт гастрономии",
    "\n/INISY": "Институт торговли и сферы услуг",
    "\n/IUBP": "Институт управления бизнес-процессами",
    "\n/IEGUIF": "Институт экономики, государственного управления и финансов",
    "\n/PI": "Политехнический институт",
    "\n/YUI": "Юридический институт",
}

#Profesores de la "Военно-инженерный институт"
Bii = {
    "-Гарин Евгений Николаевич": 'директор',
    "\n-Мамаева Елена Александровна": "заместителя директора по воспитательной работе",
    "\n-Михов Евгений Дмитриевич": "доцент",
    "\n-Копылов Владимир Алексеевич": "заместитель начальника",
    "\n-Лой Виталий Викторович": "начальник учебной части – заместитель начальника ВУЦ",
    "\n-Гладышев Андрей Борисович": "Кафедра № 6, начальник",
    "\n-Гончарик Сергей Владимирович": "Кафедра № 7, начальник",
    "\n-Иванов Максим Александрович": "Цикл, начальник",
    "\n-Колупаев Алексей Юрьевич": "Кафедра № 2, начальник",
    "\n-Лыхо Андрей Вячеславович": "Кафедра № 3, начальник",
    "\n-Михайлов Олег Борисович": "Михайлов Олег Борисович",
    "\n-Сибиряков Иван Николаевич": "Кафедра № 8, начальник",
    "\n-Чаринцев Дмитрий Алексеевич": "Кафедра № 1, начальник",
    "\n-Янович Валерий Станиславович": "Кафедра № 5, начальник"
}

#las kafedras de el instituto "Гуманитарный институт""
Gi = {
    "/gi_1": "Кафедра информационных технологий в креативных и культурных индустриях",
    "\n/gi_2": "Кафедра истории России, мировых и региональных цивилизаций",
    "\n/gi_3": "Кафедра культурологии и искусствоведения",
    "\n/gi_4": "Кафедра рекламы и социально-культурной деятельности",
    "\n/gi_5": "Кафедра философии",
    "\n/gi_6": "Лаборатория археологии Енисейской Сибири",
    "\n/gi_7": "Лаборатория естественнонаучных методов в археологии и истории",
    "\n/gi_8": "Лаборатория компьютерной графики",
    "\n/gi_9": "Музей археологии и этнографии Енисейской Сибири",
    "\n/gi_10": "Учебно-организационный отдел"
}

#Profesores de la kafedra "Кафедра информационных технологий в креативных и культурных индустриях"
gi_1 = {
    "Лаптева Марина Анатольевна": "и. о. заведующего",
    "\nАнтамошкин Олеслав Александрович": "профессор",
    "\nБарышев Руслан Александрович": "доцент",
    "\nБрюханова Евгения Романовна": "старший преподаватель",
    "\nГорячева Ольга Евгеньевна": "доцент",
    "\nГурьянов Илья Сергеевич": "старший преподаватель",
    "\nКижнер Инна Александровна": "доцент",
    "\nМусат Раиса Павловна": "профессор",
    "\nНигматуллин Илья Рафаильевич": "ассистент",
    "\nПиков Никита Олегович": "старший преподаватель",
    "\nРумянцев Максим Валерьевич": "доцент",
    "\nСенотрусова Полина Олеговна": "доцент",
}

#profesores de la kafedra "Кафедра истории России, мировых и региональных цивилизаций"
gi_2 = {
    "Гергилёв Денис Николаевич": "Аксенова Марина Николаевна",
    "\nАндюсев Борис Ермолаевич": "доцент",
    "\nАксенова Марина Николаевна": "доцент",
    "\nАхтамов Евгений Александрович": "доцент",
    "\nБарабанова Диана Дмитриевна": "доцент",
    "\nБарсукова Наталья Владимировна": "доцент",
    "\nГергилёва Алла Ивановна": "доцент",
    "\nГолубева Елена Владимировна": "доцент",
    "\nГригорьева Екатерина Александровна": "доцент",
    "\nГрязнухин Александр Григорьевич": "доцент",
    "\nГубкин Василий Федорович": "доцент",
    "\nДворецкая Анна Павловна": "доцент"
}

#profesores de la kafedra "Кафедра культурологии и искусствоведения"
gi_3 = {
    "Копцева Наталья Петровна": "заведующий, профессор",
    "\nБукова Мария Игоревна": "доцент",
    "\nВасиленко Владимир Семёнович": "старший преподаватель",
    "\nГрязнухина Татьяна Владимировна": "доцент",
    "\nЗадорина Алена Олеговна": "доцент",
    "\nЗамараева Юлия Сергеевна": "профессор",
    "\nКирко Владимир Игоревич": "профессор",
    "\nКистова Анастасия Викторовна": "доцент",
    "\nКолесник Мария Александровна": "доцент",
    "\nЛещинская Наталья Михайловна": "доцент"
}

#profesores de la kafedra "Кафедра рекламы и социально-культурной деятельности"
gi_4 = {
    "Андреева Антонина Викторовна": "заведующий, доцент",
    "\nЖуковская Людмила Николаевна": "доцент",
    "\nКостылев Сергей Валерьевич": "доцент",
    "\nЛузан Владимир Сергеевич": "доцент",
    "\nМыльникова Елена Валентиновна": "доцент",
    "\nНоздренко Елена Анатольевна": "доцент",
    "\nПантелеева Ирина Анатольевна": "доцент",
    "\nПогоревич Анастасия Владимировна": "доцент",
    "\nРукавицына Елена Александровна": "доцент",
    "\nТислянкова Валентина Ивановна": "доцент"
}

gi_5 = {
    "Кудашов Вячеслав Иванович": "заведующий, профессор",
    "\nБухтояров Михаил Сергеевич": "доцент",
    "\nБухтояров Михаил Сергеевич": "доцент",
    "\nГригоренко Екатерина Владимировна": "доцент",
    "\nГруздев Андрей Александрович": "доцент",
    "\nДемина Нина Александровна": "доцент",
    "\nДитковская Инесса Эмилевна": "доцент",
    "\nДуреева Наталья Сергеевна": "доцент",
    "\nЕлизова Людмила Александровна": "доцент",
    "\nЗавьялова Людмила Павловна": "доцент"
}

gi_6 = {
    "Мандрыка Павел Владимирович": "заведующий",
    "\nАкимова Елена Васильевна": "специалист по документообеспечению",
    "\nБирюлева Ксения Викторовна": "старший научный сотрудник",
    "\nДедик Алёна Владимировна": "старший научный сотрудник",
    "\nМаксимович Лилия Алексеевна": "специалист",
    "\nСенотрусова Полина Олеговна": "старший научный сотрудник"
}

gi_7 = {
    "Мыглан Владимир Станиславович": "заведующий",
    "\nСектор ": "архитектурного наследия",
    "\nГевель Екатерина Васильевна": "заведующий"
}

gi_9 = {
    "Мандрыка Павел Владимирович": "директор",
    "\nАкимова Елена Васильевна": "заместитель директора",
    "\nДедик Алёна Владимировна": "заместитель директора",
    "\nВдовенкова Маргарита Владимировна": "младший научный сотрудник",
    "\nКомарова Ольга Сергеевна": "главный хранитель"
}

gi_10 = {
    "Волова Мария Романовна": "начальник",
    "\nВологодский Руслан Сергеевич": "специалист",
    "\nДанюкина Дарья Викторовна": "специалист",
    "\nКарпушкина Дарья Валерьевна": "специалист по документационному обеспечению",
    "\nЧеботарь Юлия Павловна": "специалист"
}

"""Istituto Инженерно-строительный институт """
ICI = {
    "/ici_1": "Кафедра проектирования зданий и экспертизы недвижимости",
    "\n/ici_2": "Кафедра строительных конструкций и управляемых систем",
    "\n/ici_3": "Кафедра строительных материалов и технологии строительства",
    "\n/ici_4": "Кафедра автомобильных дорог и городских сооружений",
    "\n/ici_5": "Кафедра инженерных систем зданий и сооружений"
}

ici_1 = {
    "Назиров Рашит Анварович": "профессор, заведующий",
    "\nВац Наталья Александровна": "доцент",
    "\nДобросмыслов Сергей Сергеевич": "доцент",
    "\nЖуль Елена Геннадьевна": "доцент",
    "\nМельникова Елена Викторовна": "доцент",
    "\nМихеев Денис Александрович": "доцент",
    "\nНагибин Геннадий Ефимович": "доцент",
    "\nОрешонков Александр Сергеевич": "доцент",
    "\nРудских Валерия Викторовна": "доцент",
    "\nСерватинский Вячеслав Вячеславович": "доцент"
}

ici_2 = {
    "Деордиев Сергей Владимирович": "доцент, заведующий",
    "\nАрхипов Илья Николаевич": "доцент",
    "\nГригорьев Сергей Владимирович": "доцент",
    "\nКазанцев Геннадий Георгиевич": "доцент",
    "\nКудрин Виктор Георгиевич": "доцент",
    "\nЛастовка Анатолий Васильевич": "доцент",
    "\nЛях Николай Иванович": "доцент",
    "\nМаксимов Александр Владимирович": "доцент",
    "\nМаксимова Ольга Михайловна": "доцент",
    "\nМарчук Николай Иванович": "доцент"
}

ici_3 = {
    "Баранова Галина Павловна": "доцент",
    "\nБашаров Константин Германович": "доцент",
    "\nБерсенева Мария Леонидовна": "доцент",
    "\nВасиловская Галина Васильевна": "доцент",
    "\nВасиловская Нина Григорьевна": "доцент",
    "\nГуменная Елена Юрьевна": "доцент",
    "\nДружинкин Сергей Валентинович": "доцент",
    "\nЕнджиевская Ирина Геннадьевна": "доцент",
    "\nКалугин Илья Георгиевич": "доцент",
    "\nКлимов Алексей Сергеевич": "доцент"
}

ici_5 = {
    "Матюшенко Анатолий Иванович": "профессор, заведующий",
    "\nАвласевич Александр Иванович": "доцент",
    "\nБерсенева Мария Леонидовна": "доцент",
    "\nДубровская Ольга Геннадьевна": "доцент",
    "\nЖуйков Андрей Владимирович": "доцент",
    "\nКурилина Татьяна Александровна": "доцент",
    "\nОленев Игорь Борисович": "доцент",
    "\nПазенко Татьяна Яковлевна": "доцент",
    "\nПанфилов Виталий Иванович": "доцент",
    "\nПриймак Лилия Владимировна": "доцент"
}

ici_4 = {
    "Серватинский Вадим Вячеславович": "доцент, заведующий",
    "\nАртемьева Наталия Александровна": "доцент",
    "\nБогданов Игорь Яковлевич": "доцент",
    "\nВоротынова Ольга Владленовна": "доцент",
    "\nГавриленко Татьяна Валентиновна": "доцент",
    "\nГавриш Валентина Владимировна": "доцент",
    "\nГоряева Елена Владимировна": "доцент",
    "\nЖуравлев Виктор Юрьевич": "доцент",
    "\nИванова Людмила Алексеевна": "доцент",
    "\nКрафт Светлана Леопольдовна": "доцент"
}